cf/Catalogs/НоменклатураСайтProm.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НоменклатураСайтProm</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоменклатураКопия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураОбщая</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиИзНоменклатуры</Name>
					<Comment>Брать значения настроек из справочника номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies_ru</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>h1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_description_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_keywords</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_keywords_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>title_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляДилеров</Name>
					<Comment>Выгружать товар на сайт дилеров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание_Дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Comment>для сайта и получения порций информации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СортировкаДопРеквизитов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>views_count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>sorting_weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>link_title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>link_text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МнениеЭксперта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>view_type</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерЗакупок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синонимы</Name>
					<Comment>Перечиcляются через ","</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВместеСТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРодители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураСайтProm</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорядокТегов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/НоменклатураСайтProm/Ext/ObjectModule.bsl
Функция СформироватьAliesИзНаименования()
	
	ДоступныеСимволы 	= "-_1234567890ABCDEIFGHIJKLMNOPQRSTUVWXYZАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЁ";
	СимволыНаТире 		= ".,=;/\- ";
	
	НаименованиеВРег 	= ВРег(СокрЛП(Наименование));
	ДлинаНаим 			= СтрДлина(СокрЛП(Наименование));
	
	СтрAlies = "";
	
	Для ном = 1 По ДлинаНаим Цикл текСимволВрег = Сред(НаименованиеВРег, ном, 1); текСимвол = Сред(Наименование, ном, 1); Если Найти(ДоступныеСимволы, текСимволВрег) Тогда СтрAlies = СтрAlies + текСимвол; ИначеЕсли Найти(СимволыНаТире, текСимволВрег) Тогда СтрAlies = СтрAlies + "-"; КонецЕсли;КонецЦикла;
	
	// { Удалить - временная мера
	
	СтрAlies = СтрЗаменить(СтрAlies, "--", "-");
	СтрAlies = СтрЗаменить(СтрAlies, "--", "-");
	СтрAlies = СтрЗаменить(СтрAlies, "--", "-");
	СтрAlies = СтрЗаменить(СтрAlies, "--", "-");
	
	Если Прав(СтрAlies,1) = "-" Тогда СтрAlies = Лев(СтрAlies, СтрДлина(СтрAlies) - 1) КонецЕсли;
	Если Прав(СтрAlies,1) = "-" Тогда СтрAlies = Лев(СтрAlies, СтрДлина(СтрAlies) - 1) КонецЕсли;
	Если Прав(СтрAlies,1) = "-" Тогда СтрAlies = Лев(СтрAlies, СтрДлина(СтрAlies) - 1) КонецЕсли;
	
	// }
	
	Возврат СтрAlies;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
		
	// Установим порядковый номер
	
	Если Не ПорядковыйНомер Тогда
		
		Максимум = ?(ЭтоГруппа, 
						Константы.МаксимальныйПорядковыйНомерКатегории.Получить(),
						Константы.МаксимальныйПорядковыйНомер.Получить());
						
		ПорядковыйНомер = Максимум + 1; КонецЕсли;
	
	// Проверим alies
	
	Если ПустаяСтрока(alies) Тогда
		                                                                                  
		alies = НРег(КонвертацияТипов.ПреобразоватьРусскийТекстВАнглицкий(СформироватьAliesИзНаименования()));
		
	ИначеЕсли КонвертацияТипов.ЕстьРусскиеБуквы(alies) Тогда
		
		// Проверим чтобы alies был токо англицкий
		
			alies = НРег(КонвертацияТипов.ПреобразоватьРусскийТекстВАнглицкий(СформироватьAliesИзНаименования())); КонецЕсли;
	
	Если ПустаяСтрока(alies_ru) Тогда alies_ru = НРег(СформироватьAliesИзНаименования()) КонецЕсли;
	
	новАлиес = HTTP.ПроверитьИПолучитьНовыйAlies(Ссылка, ЭтоНовый(), alies);
	Если новАлиес <> alies Тогда alies = новАлиес КонецЕсли;
	
	новАлиес = HTTP.ПроверитьИПолучитьНовыйAlies(Ссылка, ЭтоНовый(), alies_ru, "alies_ru");
	Если новАлиес <> alies_ru Тогда alies_ru = новАлиес КонецЕсли;
			
	// Если алиес изменился тогда запоминаем его
	Если Не ПустаяСтрока(Ссылка.alies) И Ссылка.alies <> alies Тогда
		СтарыйURL = Ссылка.alies + ?(ПустаяСтрока(СтарыйURL), "", Символы.ПС + СтарыйURL); КонецЕсли;
	
	//// КОД
	//
	//Если ПустаяСтрока(Код2) Тогда
	//	Запрос 	= Новый Запрос("ВЫБРАТЬ Количество(Ссылка) Кол ИЗ Справочник.Номенклатура");
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Выборка.Следующий();
	//	Код2 = Выборка.Кол; КонецЕсли;
			
	
	// Запомним когда был создан
	
	Если ЭтоНовый() Тогда 
		ДатаСоздания = ТекущаяДата();
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////////
	//// Проверим код товара и если он не по правилам то зададим его
	////////////////////////////////////////////////////////////////////////////////
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//	                      |	СпрНом.Ссылка.Производитель,
	//	                      |	МАКСИМУМ(СпрНом.Код2) КАК Код2
	//	                      |ПОМЕСТИТЬ Таблица
	//	                      |ИЗ
	//	                      |	Справочник.НоменклатураСайтGarage КАК СпрНом
	//	                      |ГДЕ
	//	                      |	СпрНом.Производитель = &ПР
	//	                      |	И СпрНом.Код2 ПОДОБНО &Рег0
	//	                      |
	//	                      |СГРУППИРОВАТЬ ПО
	//	                      |	СпрНом.Ссылка.Производитель
	//	                      |
	//	                      |ОБЪЕДИНИТЬ ВСЕ
	//	                      |
	//	                      |ВЫБРАТЬ
	//	                      |	Спр.Ссылка.Производитель,
	//	                      |	МАКСИМУМ(Спр.Код2)
	//	                      |ИЗ
	//	                      |	Справочник.НоменклатураСайтGarage КАК Спр
	//	                      |ГДЕ
	//	                      |	Спр.Производитель = &ПР
	//	                      |	И Спр.Код2 ПОДОБНО &Рег1
	//	                      |
	//	                      |СГРУППИРОВАТЬ ПО
	//	                      |	Спр.Ссылка.Производитель
	//	                      |;
	//	                      |/////////////////////////////
	//						  |ВЫБРАТЬ
	//	                      |	Таблица.СсылкаПроизводитель,
	//	                      |	МИНИМУМ(Таблица.Код2) КАК Код2
	//	                      |ИЗ
	//	                      |	Таблица КАК Таблица
	//	                      |
	//	                      |СГРУППИРОВАТЬ ПО
	//	                      |	Таблица.СсылкаПроизводитель");
	//	Запрос.УстановитьПараметр("Рег0", "[0-9][0-9][0-9].[0-9][0-9][0-9]");
	//	Запрос.УстановитьПараметр("Рег1", "[0-9][0-9][0-9].[0-9][0-9].[0-9][0-9][0-9]");
	//////////////////////////////////////////////////////////////////////////////////////////
	//Если НЕ ЭтоГруппа И	Не Производитель.Пустая() И Производитель.Код <> Лев(Код2, 3) Тогда
	//			
	//	НовКод 		= 1;
	//	Запрос.УстановитьПараметр("ПР", Производитель);
	//	ВыборкаКод = Запрос.Выполнить().Выбрать();
	//	Если ВыборкаКод.Следующий() Тогда
	//		НовКод = Число(СтрЗаменить(Прав(ВыборкаКод.Код2, СтрДлина(ВыборкаКод.Код2) - Найти(ВыборкаКод.Код2, ".")), ".", ""))+1;
	//	КонецЕсли;
	//	////////////////////////////////////////////////////////////////
	//	Код2 = Производитель.Код + "." + Формат(НовКод, "ЧЦ=" + ?(НовКод >= 1000, "5", "3") + "; ЧРД=; ЧРГ=.; ЧВН=");
	//	////////////////////////////////////////////////////////////////
	//ИначеЕсли НЕ ЭтоГруппа И Производитель.Пустая() И Лев(Код2, 3) <> "000" Тогда
	//	
	//	НовКод 		= 1;
	//	Запрос.УстановитьПараметр("ПР", Справочники.Производители.ПустаяСсылка());
	//	ВыборкаКод = Запрос.Выполнить().Выбрать();
	//	Если ВыборкаКод.Следующий() Тогда
	//		НовКод = Число(СтрЗаменить(Прав(ВыборкаКод.Код2, СтрДлина(ВыборкаКод.Код2) - Найти(ВыборкаКод.Код2, ".")), ".", ""))+1;
	//	КонецЕсли;
	//	////////////////////////////////////////////////////////////////
	//	Код2 = "000" + "." + Формат(НовКод, "ЧЦ=" + ?(НовКод >= 1000, "5", "3") + "; ЧРД=; ЧРГ=.; ЧВН=");
	//	////////////////////////////////////////////////////////////////
	//КонецЕсли;
	//	////////////////////////////////////////////////////////////////
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Увеличим константу порядкового номера
	
	ИмяКонстанты = ?(ЭтоГруппа, 
						"МаксимальныйПорядковыйНомерКатегории", 
						"МаксимальныйПорядковыйНомер");
	
	Если ПорядковыйНомер > Константы[ИмяКонстанты].Получить() Тогда Константы[ИмяКонстанты].Установить(ПорядковыйНомер) КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	// Сбросим номер, вдруг он копируется
	
	Если ЭтоНовый() Тогда ПорядковыйНомер = 0 КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВыгружатьНаСайт Или ДляДилеров Тогда
		ПроверяемыеРеквизиты.Добавить("Артикул"); КонецЕсли;
	
КонецПроцедуры
